Repository: MLRS/gabra-web
Catalog: app/Locale/mlt/LC_MESSAGES/default.po
Languages: mt

source: Invalid ID
mt: ID ħażin

source: Empty query
mt: Query vojt

source: adjective
mt: aġġettiv

source: adposition
mt: apposizzjoni

source: adverb
mt: avverb

source: auxiliary verb
mt: verb awżiljarju

source: coordinating conjunction
mt: konġunzjoni koordinanti

source: determiner
mt: determinant

source: interjection
mt: inteġrezzjoni

source: noun
mt: nom

source: particle
mt: partiċipju

source: pronoun
mt: pronom

source: proper noun
mt: nom propju

source: punctuation
mt: punteġġatura

source: subordinating conjunction
mt: konġunzjoni subordinenti

source: symbol
mt: simbolu

source: other
mt: oħrajn

source: strong
mt: sħiħ

source: geminated
mt: trux

source: weak initial
mt: dgħajjef assimilattiv

source: weak medial
mt: dgħajjef moħfi

source: weak final
mt: dgħajjef nieqes

source: irregular
mt: irregolari

source: Flagged
mt: Entrati mmarkati

source: Pending
mt: Pendenti

source: Invalid message
mt: Messaġġ ħażin

source: Thank you, we have received your feedback
mt: Grazzi, il-kummenti tiegħek ġew irrekordjati

source: Error
mt: Problema

source: Feedback cleared
mt: Il-kummenti tneħħew

source: Item saved
mt: L-entrata ġiet issejvjata

source: Changes saved
mt: Tibdiliet ssejvjati

source: Entry deleted
mt: L-entrata tħassret

source: No duplicates found for:
mt: L-ebda entrata doppja għal:

source: Entries merged
mt: Entrati magħqudin

source: Entry marked as non-duplicate
mt: Entrata ġiet mmarkata li m'hix doppja

source: Invalid username or password, try again
mt: Username jew password ħażina, erġa' prova.

source: User deleted
mt: Il-user tħassar

source: Delete failed
mt: It-tħassir ma rnexxiex

source: This page is only available in English.
mt: Din il-paġna teżisti biss bl-Ingliż.

source: Search all of Ġabra
mt: Fittex f'Ġabra kollha

source: Search for a word
mt: Fittex kelma

source: Search roots
mt: Fittex fl-għeruq

source: or
mt: jew

source: none
mt: ebda

source: Radicals
mt: Radikali

source: Class
mt: Klassi

source: Help
mt: Għajnuna

source: Legend
mt: Spjegazzjoni

source: Superscript numbers %s beside roots indicate multiple meanings
mt: Numri f'sopraskritt %s ħdejn l-għeruq jindikaw iktar minn tifsira waħda

source: Entries in %s(parenthesis)%s indicate variants
mt: Affarjiet ġo %s(parenteżi)%s juru varjanti

source: Items in %sred%s are hypothetical, unused or obsolete forms listed in dictionaries
mt: Affarijiet mmarkati %sbl-aħmar%s huma dawk li għandhom jitqiesu bħala ipotetiċi, jew m'għadhomx jintużaw.

source: Root search
mt: Fittex fl-għeruq

source: Use the root search when you want to filter the roots by some specific criteria.
mt: Fittex fost l-għeruq meta għandek ċerti kriterji speċifiċi.

source: It acts as a convenient shortcut for the more advanced search syntax (below).
mt: Tista' tużaha bħala alternattiva konvenjenti għas-sintassi avvanzata (ara iktar 'l isfel)

source: Selecting nothing from a dropdown will match anything in that position.
mt: Fejn ma tagħżel l-ebda għażla, tgħodd bħala kull possibiltà f'dik il-posizzjoni.

source: Select %s to match either a <em>j</em> or a <em>w</em>
mt: Għażel %s biex ssib jew <em>j</em> inkella <em>w</em>

source: The apostrophe %s indicates a missing radical, in irregular roots.
mt: L'apostrofu %s jissimboliza radikali nieqes, bħalma nsibu fl-għeruq irregolari.

source: Advanced search syntax
mt: Sintassi tat-tfittxija avvanzata

source: Queries follow regular expression syntax:
mt: Tfittxiet jużaw sintassi ta' <em>regular expressions</em>:

source: %s matches any single letter (including <em>ie</em> and <em>għ</em>)
mt: %s jsib ittra waħedha (tinkludi <em>ie</em> u <em>għ</em>)

source: %s matches beginning of string
mt: %s jfisser il-bidu tal-kelma

source: %s matches the end of string
mt: %s jfisser it-tarf tal-kelma

source: %s matches 1 or more repetitions of the previous expression
mt: %s jfisser repetizzjoni ta' l-inqas darba mill-espressjoni preċedenti

source: %s matches 0 or more repetitions of the previous expression
mt: %s jfisser repetizzjoni ta' żero jew iktar drabi mill-espressjoni preċedenti

source: %s matches 0 or 1 occurances of the previous expression
mt: %s jfisser repetizzjoni ta' 0 jew darba waħda mill-espressjoni preċedenti

source: Character classes can be enclosed in %s
mt: Settijiet ta' karattri għandhom jkunu mdawrin bi %s

source: Examples
mt: Eżempji

source: %s matches <em>k</em> as first radical and <em>b</em> as third radical
mt: %s jsib kull għerq bl-ittra <em>k</em> bħala l-ewwel radikali u <em>b</em> bħala t-tielet radikali

source: %s matches any weak-final root
mt: %s jsib l-għeruq neqsin kollha

source: %s matches any item beginning with <em>għar</em>
mt: %s jsib kull ħaġa li tibda bis-sekwenza <em>għar</em>

source: %s matches any item beginning with <em>kit</em> and ending with <em>hom</em>
mt: %s jsib kull entrata li tibda bis-sekwenza <em>kit</em> u li tispiċċa bi <em>hom</em>

source: %s matches both <em>sama'</em> and <em>sema'</em>
mt: %s jirritorna

source: first
mt: tal-ewwel

source: previous
mt: ta' qabel

source: next
mt: li jmiss

source: last
mt: tal-aħħar

source: Page {:page} of {:pages}, showing records {:start} to {:end} out of {:count} total.
mt: Paġna {:page} minn {:pages}, entrati {:start} sa {:end} minn total ta' {:count}.

source: Surface form
mt: Forma miktuba

source: Gender
mt: Sess

source: Number
mt: Numru

source: Phonetic
mt: Fonetiku

source: Pattern
mt: Mudell

source: Derived form
mt: Forma mnissla

source: Form
mt: Forma

source: Aspect
mt: Aspett

source: Subject
mt: Suġġett

source: Direct Object
mt: Oġġett dirett

source: Indirect Object
mt: Oġġett indirett

source: Polarity
mt: Polarità

source: Masc
mt: Mask

source: Masc/Fem
mt: Mask/Fem

source: Dual
mt: Doppju

source: Singulative
mt: Singulattiv

source: Collective
mt: Kollettiv

source: Perfective
mt: Perfett

source: Imperfective
mt: Imperfett

source: Imperative
mt: Imperattiv

source: Past Participle
mt: Partiċipju passiv

source: Present Participle
mt: Partiċipju attiv

source: Positive
mt: Posittiv

source: Negative
mt: Negattiv

source: Diminutive
mt: Diminuttiv

source: Comparative
mt: Komparattiv

source: Superlative
mt: Superlattiv

source: Lookup in MLRS corpus
mt: Fittex fil-korpus tal-MLRS

source: e.g.
mt: eż.

source: %s more matches
mt: %s risultati oħra

source: What is wrong with this entry?
mt: X'hemm ħażin f'din l-entrata?

source: This item has been marked as incorrect
mt: Din l-entrata ġiet immarkata ħażina

source: You must select at least one entry to merge
mt: Agħżel mill-inqas entrata waħda biex tgħaqqadhom

source: This will ONLY merge glosses into this entry. Continue?
mt: Hekk ħa tgħaqqad biss it-traduzzjonijiet. Trid tkompli?

source: Are you sure you want to delete this entry?
mt: Ċert li trid tħassar din l-entrata?

source: Did you mean:
mt: Forsi ridt tfisser:

source: Submit
mt: Issottometti

source: Cancel
mt: Ikkanċella

source: Click here to suggest that %s is added to the database.
mt: Ikklikja hawn biex tissuġġerixxi li nżidu %s fil-ġabradata.

source: Suggest a new entry
mt: Suġġeriment għal entrata ġdida

source: Lemma
mt: Kelma

source: Word in Maltese
mt: Kelma bil-Malti

source: Gloss
mt: Traduzzjoni

source: Translation in English
mt: Traduzzjoni bl-Ingliż

source: Part of speech
mt: Kategorija

source: Noun, verb, adjective or other
mt: Nom, verb, aġġettiv jew xi ħaġa oħra

source: Your suggestion has been added.
mt: Is-suġġeriment tiegħek ġie rrekordjat.

source: An error occurred
mt: Xi ħaġa ma ħadmitx

source: Any
mt: Kollha

source: Empty
mt: Vojt

source: Toggle navigation
mt: Ara/aħbi l-menu

source: Advanced search
mt: Tfittxija avvanzata

source: More
mt: Iktar

source: About
mt: Dwar dan is-sit

source: Sources
mt: Sorsi

source: Random entry
mt: Sib kelma għall-għarrieda

source: Schema
mt: Skema

source: Download
mt: Niżżel

source: Login
mt: Idħol fil-Kont

source: Duplicates
mt: Entrati doppji

source: Logout
mt: Oħroġ mill-kont

source: Ġabra: an opportunistic collection of Maltese lexical resources
mt: Ġabra ta' risorsi lessikali bil-Malti

source: Add lexeme
mt: Żid entrata

source: Use commas to separate multiple alternatives
mt: Uża komma biex tissepara l-alternattivi

source: Root
mt: Għerq

source: New field with name:
mt: Dettal ġdid bl-isem:

source: Add
mt: Żid

source: Use the field above to search
mt: Fittex permezz tal-kaxxa t'hawn fuq

source: No results found.
mt: Ma nstab l-ebda rizultat.

source: %s to let us know that "%s" should be added to the database.
mt: %s biex nżidu "%s" fil-ġabradata.

source: Click here
mt: Ikklikkja hawn

source: Search
mt: Fittex

source: Edit
mt: Biddel

source: Clear feedback
mt: Neħħi l-kummenti

source: Clear feedback for this entry?
mt: Neħħi l-kummenti għal din l-entrata?

source: Delete
mt: Ħassar

source: Search lemmas
mt: Fittex fil-lessemi

source: Search wordforms
mt: Fittex fili-forom verbali

source: Regex search in wordforms (slow)
mt: Fittex bir-regular expressions (tieħu iktar ħin)

source: Search in English glosses
mt: Fittex fit-traduzzjonijiet bl-Ingliż

source: All
mt: Kollha

source: Source
mt: Sors

source: Search help
mt: Għajnuna biex tfittex

source: The search is sensitive to Maltese characters. This means that %s is not the same as %s.
mt: Ara li tuża l-karattri propji tal-Malti. Dan ifisser li %s m'huwiex l-istess bħal %s.

source: Use the buttons to the right of the search to insert Maltese characters into the search box.
mt: Uża l-buttuni ħdejn il-kaxxa tat-tfittix biex iddaħħal ittri Maltin

source: To search by English translation, check the <strong>Search in English glosses</strong> box.
mt: Biex tfittex fit-traduzzjonijiet bl-Ingliż, immarka l-kaxxa <strong>Fittex fit-traduzzjonijiet</strong>.

source: Currently, one can only search by substring from the start of a word. This means that %s will not match %s.
mt: Bħalissa tista' tfittex biss għall-bidu ta' kelma. Dan ifisser li %s m'hix ħa tirritornalek %s.

source: %d entries for this lemma
mt: %d entrati għal din il-lemma

source: %s lemmas found with multiple entries
mt: %s lemmas b'iktar minn entrata waħda

source: %s lemmas total
mt: %s b'kollox

source: Search as lexeme
mt: Fittex bħala lessimu

source: Search in duplicates
mt: Fittex fl-entrati doppji

source: Features
mt: Karatteristiċi

source: Merge
mt: Għaqqad

source: Actions
mt: Għażliet

source: merge this
mt: għaqqad din

source: into this
mt: ma' din

source: Not duplicate
mt: M'hix doppja

source: Edit lexeme
mt: Mmodifika kelma

source: Lexeme
mt: Lessimu

source: Use commas to separate multiple sources
mt: Uża komma biex tissepara s-sorsijiet

source: View
mt: Ara

source: Wordforms
mt: Forom verbali

source: Are your sure you want to delete this wordform?
mt: Ħassar din il-forma verbali?

source: Save wordforms
mt: Issejvja forom verbali

source: No manual wordforms
mt: Ebda forma manwali

source: Add wordform
mt: Żid forma verbali

source: Copy lemma
mt: Ikkopja l-lemma

source: Results: %s
mt: Riżultati: %s

source: Load more results
mt: Ara iktar resultati

source: Merge into (keep this entry):
mt: Żomm din l-entrata:

source: Swap
mt: Eqleb l-ordni

source: Merge from (delete this entry):
mt: Ħassar din l-entrata:

source: On merging, these will be associated with the remaining entry
mt: Meta tgħaqqad l-entrati, dawn jiġu assoċjati mal-entrata l-oħra

source: This entry has been flagged and may contain errors.
mt: Din l-entrata hija mmarkata bħala ħażina u tista' tinkludi xi żbalji.

source: English gloss
mt: Traduzzjoni bl-Ingliż

source: Source(s)
mt: Sors(i)

source: Created
mt: Kkreat

source: Modified
mt: Mibdul

source: Provide feedback about this entry
mt: Ħalli kumment fuq din l-entrata

source: Edit entry
mt: Biddel entrata

source: Related entries
mt: Entrati relatati

source: Word forms
mt: Forom verbali

source: Show all forms
mt: Ara l-forom kollha

source: Add message
mt: Messaġġ ġdid

source: Edit message
mt: Biddel il-messaġġ

source: Save
mt: Issejvja

source: Messages
mt: Messaġġi

source: New message
mt: Messaġġ ġdid

source: English
mt: Ingliż

source: Maltese
mt: Malti

source: Are you sure you want to delete # %s?
mt: Ċert li trid tħassar # %s?

source: File name
mt: Isem il-fajl

source: Size
mt: Daqs

source: Latest
mt: Ta' l-aħħar

source: Ġabra: a collection of Maltese lexical resources
mt: Ġabra ta' risorsi lessikali bil-Malti

source: Search in Maltese or English, e.g. "%s" or "%s"
mt: Fittex bil-Malti jew bl-Ingliż, eż. "%s" jew "%s"

source: News
mt: Aħbarijiet

source: See all
mt: Kollha

source: Statistics
mt: Statistika

source: Roots
mt: Għeruq

source: Lexeme entries
mt: Kliem

source: Mistakes/missing information
mt: Żbalji/informazzjoni nieqsa

source: Citing Ġabra
mt: Biex tiċċita dan is-sit

source: Database schema
mt: Skema tal-ġabradata

source: Type
mt: Klassi

source: Quad.
mt: Kwad.

source: Related
mt: Relatati

source: Note
mt: Noti

source: Title
mt: Titlu

source: Authors
mt: Awturi

source: Year
mt: Sena

source: Add user
mt: Żid user

source: Edit user
mt: Biddel dan il-user

source: Please enter your username and password
mt: Daħħal il-username u password tiegħek

source: Role
mt: Rwol

source: A username is required
mt: Jeħtieġ username

source: A password is required
mt: Jeħtieġ password

source: Please enter a valid role
mt: Agħżel rwol validu
